In [2]:
from sqlalchemy import create_engine, text
import pandas as pd
import time
from kafka_source.fakedata import create_fakeuser

mysql = create_engine(f"mysql+pymysql://hyunsoo:910506@localhost:3306/dataops?charset=utf8mb4")

cursor = mysql.connect()

In [4]:
postgres = create_engine(f"postgresql://yein:941021@localhost:5432/postgres")

pd.read_sql("SELECT * FROM pg_settings WHERE name = 'wal_level'", postgres)

,name,setting,unit,category,short_desc,extra_desc,context,vartype,source,min_val,max_val,enumvals,boot_val,reset_val,sourcefile,sourceline,pending_restart
0,wal_level,logical,None,Write-Ahead Log / Settings,Sets the level of information written to the WAL.,None,postmaster,enum,configuration file,None,None,"[minimal, replica, logical]",replica,logical,/var/lib/postgresql/data/postgresql.conf,205,False

In [8]:
df = pd.DataFrame([create_fakeuser()])
df.dtypes

name           object
ssn            object
job            object
residence      object
blood_group    object
sex            object
birthdate      object
uuid           object
dtype: object

In [ ]:
for _ in range(10):

    pdf = pd.DataFrame([create_fakeuser()])
    pdf.to_sql(name="dataops", con=conn, if_exists="append")
    time.sleep(10)

In [10]:
cursor.execute(text("DELETE FROM dataops WHERE birthdate = '20000613'"))
cursor.commit()

In [11]:
cursor.execute(text("UPDATE dataops SET name = 'hyunsoo lee' WHERE birthdate = '19810916'"))
cursor.commit()

In [10]:
df = pd.read_csv("./tutorial/data/names.csv")

df.to_sql(name="names", con=conn, if_exists="replace")

2000

In [13]:
pd.read_sql("SELECT * FROM dataops.names", conn).head()

   index  id       name  year gender  count
0      0   1       Mary  1880      F   7065
1      1   2       Anna  1880      F   2604
2      2   3       Emma  1880      F   2003
3      3   4  Elizabeth  1880      F   1939
4      4   5     Minnie  1880      F   1746